Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawings Method (IEnumerable<Drawing>, DPMPrinterAttributes, String)
 Prints the list of drawings using the given printer attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PrintDrawings(
	IEnumerable<Drawing> drawings,
	DPMPrinterAttributes printAttributes,
	string OutputFolder
)
Public Function PrintDrawings (
	drawings As IEnumerable(Of Drawing),
	printAttributes As DPMPrinterAttributes,
	OutputFolder As String
) As Boolean
Parameters
drawings
Type: System.Collections.Generic.IEnumerable<Drawing>
The list of drawings to be printed.
printAttributes
Type: Tekla.Structures.Drawing.DPMPrinterAttributes
The print attributes for the print job.
OutputFolder
Type: System.String
The output folder as an absolute path or relateive to the model folder.
Return Value
Type: Boolean
True on success, false if printing fails.
Exceptions
Exception | Condition
ArgumentException | Thrown if PDF printing selected, but no file name provided.
ArgumentNullException | Thrown if drawings or printerAttributes is null.
Remarks
If there is an active drawing visible in the drawing editor and it is a different drawing to the specified drawings, the active drawing will be closed.
See Also
Reference
DrawingHandler Class
PrintDrawings Overload
Tekla.Structures.Drawing Namespace